app/views/houses/show.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."house_id" = $1  [["house_id", 1]]
---
<ul>
<% @house.characters.each do |name| %>