app/controllers/characters_controller.rb

INSERT INTO "characters" ("created_at", "updated_at", "name", "alive", "house_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", 2016-11-07 21:11:23 UTC], ["updated_at", 2016-11-07 21:11:23 UTC], ["name", "Geoffrey"], ["alive", true], ["house_id", 1]]
---
  def create
    @house = House.find(params[:house_id])
    @character = @house.characters.create(character_params)