app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)
    @house.save
---
INSERT INTO "houses" ("created_at", "updated_at", "coat_url", "seat", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

def update
  @house = House.find(params[:id])
  @house.update(house_params)
---
UPDATE "houses" SET "name" = $1, "updated_at" = $2 WHERE "houses"."id" = $3  [["name", "Bannister"], ["updated_at", 2016-11-07 20:24:04 UTC], ["id", 1]]

  def destroy
    @house = House.find(params[:id])
    @house.destroy
---
DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 5]]